{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "cec21302-45d0-40f3-addc-1b3684cb9a88",
   "metadata": {},
   "source": [
    "# Test de conexiones: Neo4j, MongoDB y Redis\n",
    "Ejecutá las celdas de abajo para verificar que todo está OK."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "0b3018d7-722f-4273-9b2e-9898633af80b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Esperando servicios (5s)...\n"
     ]
    }
   ],
   "source": [
    "import os, time\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\", \"neo4j123\")\n",
    "MONGO_USER = os.getenv(\"MONGO_INITDB_ROOT_USERNAME\", \"admin\")\n",
    "MONGO_PASS = os.getenv(\"MONGO_INITDB_ROOT_PASSWORD\", \"admin123\")\n",
    "REDIS_PASSWORD = os.getenv(\"REDIS_PASSWORD\", \"redis123\")\n",
    "print(\"Esperando servicios (5s)...\")\n",
    "time.sleep(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "910d7df6-62fc-4d1e-b2d2-0152467de8b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "driver = GraphDatabase.driver(\"bolt://neo4j:7687\", auth=(\"neo4j\", NEO4J_PASSWORD))\n",
    "with driver.session() as s:\n",
    "    s.run(\"CREATE (:City {name:$name})\", name=\"La Plata\")\n",
    "    print(s.run(\"MATCH (n:City) RETURN count(n) AS c\").single()[\"c\"])\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "b9ac251b-64d0-4015-9c46-cb5a6a4854bd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from pymongo import MongoClient\n",
    "client = MongoClient(f\"mongodb://{MONGO_USER}:{MONGO_PASS}@mongo:27017/\")\n",
    "db = client[\"clase\"]\n",
    "db.alumnos.insert_one({\"nombre\":\"Edu\",\"tema\":\"Grafos\"})\n",
    "db.alumnos.count_documents({})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "8fab3459-26f8-4721-ba3b-9f775eb46eac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'hola'"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import redis\n",
    "r = redis.Redis(host=\"redis\", port=6379, password=REDIS_PASSWORD, decode_responses=True)\n",
    "r.set(\"saludo\",\"hola\")\n",
    "r.get(\"saludo\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
